# інсталяція flake8 and radon пакетів для Python
pip install flake8 radon mccabe

# перевірка на помилки та попередження одного файлу .py
python -m flake8 src/kulyk04/main.py

# перевірка на помилки та попередження усіх файлів .py в директорії
python -m flake8 src/kulyk04/


# розрахунок цикломатичного числа Мак-Кейба для одного файлу .py
python -m mccabe kulyk04/file.py


# розрахунок цикломатичної складності програми для одного файлу .py
python -m radon cc src/kulyk04/main.py

# розрахунок цикломатичної складності програми для усіх файлів .py в директорії
python -m radon cc src/kulyk04/


# підрахунок числа строк у файлі, а також окремо числа строк із безпосередньо кодом 
# і числа строк-коментарів для одного файлу .py
python -m radon raw src/kulyk04/main.py

# підрахунок числа строк у файлі, а також окремо числа строк із безпосередньо кодом 
# і числа строк-коментарів для усіх файлів .py в директорії
python -m radon raw src/kulyk04/


# індекс говорить нам про те, як складно буде підтримувати або редагувати блок програми. 
# Цей параметр розраховується на основі чисел, одержаних з метрик, порахованих вище (для файлу)
python -m radon mi src/kulyk04/main.py

# індекс говорить нам про те, як складно буде підтримувати або редагувати блок програми. 
# Цей параметр розраховується на основі чисел, одержаних з метрик, порахованих вище (для файлів в директорії)
python -m radon mi src/kulyk04/
